app/views/users/show.html.erb

SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`user_id` = 11
---
<table>
<% @user.resumes.each do |resume| %>