app/controllers/resumes_controller.rb

   def create
      @user = User.find(params[:user_id])
      @resume = @user.resumes.create(params[:resume])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO `resumes` (`created_at`, `default`, `email`, `firstName`, `html`, `lastName`, `middleNames`, `resumeName`, `updated_at`, `user_id`) VALUES ('2012-02-01 19:23:30', NULL, NULL, NULL, NULL, NULL, NULL, 'Resume For Order', '2012-02-01 19:23:30', 71)

   def show

    @user = User.find(params[:user_id])
    @resume = Resume.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @user = User.find(params[:user_id])
    @resume = Resume.find(params[:id])
    @resume.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`id` = 11 LIMIT 1
DELETE FROM `resumes` WHERE `resumes`.`id` = 11