app/controllers/resume_items_controller.rb

   def create
      @user = User.find(params[:user_id])
      @resume = Resume.find(params[:resume_id])
      @resumeItem = @resume.resume_items.create(params[:resume_item])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO `resume_items` (`created_at`, `description`, `endMonth`, `endSeason`, `endYear`, `link`, `location`, `order`, `positiontitle`, `resume_id`, `section`, `startMonth`, `startSeason`, `startYear`, `type`, `updated_at`) VALUES ('2012-02-01 19:26:25', 'Wrote the code generator and runtime for compilation from CMU\'s Plaid language to JavaScript\r\nDeveloped novel representation for state at runtime, optimized state change\r\nMy work on this project won first place in an ACM Student Research Competition', '', '', NULL, '', 'Pittsburgh', 1, 'CMU Summer Researcher', 61, 'Professional Experience', '', 'Summer', 2011, NULL, '2012-02-01 19:26:25')

  def new
    @user = User.find(params[:user_id])
    @resume = Resume.find(params[:resume_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "2"]]

  def edit

    @user = User.find(params[:user_id])

    @resume = Resume.find(params[:resume_id])
    @resumeItem = ResumeItem.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 71 LIMIT 1
SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`id` = 61 LIMIT 1
SELECT `resume_items`.* FROM `resume_items` WHERE `resume_items`.`id` = 21 LIMIT 1

  def destroy
    @user = User.find(params[:user_id])
    @resume = Resume.find(params[:resume_id])
    @resumeItem = ResumeItem.find(params[:id])
    @resumeItem.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "resumes".* FROM "resumes" WHERE "resumes"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "resume_items".* FROM "resume_items" WHERE "resume_items"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "resume_items" WHERE "resume_items"."id" = ?  [["id", 4]]