app/controllers/sections_controller.rb

   def create
      @user = User.find(params[:user_id])
      @resume = Resume.find(params[:resume_id])
      @section = @resume.sections.create(params[:section])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`id` = 21 LIMIT 1
INSERT INTO `sections` (`created_at`, `name`, `order`, `resume_id`, `updated_at`) VALUES ('2012-02-02 02:12:37', 'Professional Experience', 1, 21, '2012-02-02 02:12:37')

  def new
    @user = User.find(params[:user_id])
    @resume = Resume.find(params[:resume_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`id` = 21 LIMIT 1