app/controllers/users_controller.rb

  def create

    @user = User.new(params[:user])


    respond_to do |format|

      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `passwordHash`, `passwordSalt`, `updated_at`, `username`) VALUES ('2012-02-01 19:23:18', 'test1@gmail.com', '$2a$10$95NQw9/6g1.3oGAGvn5MOOpeeUTKmFFoI2vwKtM03d/5ZtVgZmwym', '$2a$10$95NQw9/6g1.3oGAGvn5MOO', '2012-02-01 19:23:18', 'testUser')

  def update

    @user = User.find(params[:id])


    respond_to do |format|

      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "passwordHash" = '$2a$10$9DujbVmN1vMy/kr/WKgWc.QzLa/ZJ4JSAK6rNq6jUOo.Uk3.GPPhK', "passwordSalt" = '$2a$10$9DujbVmN1vMy/kr/WKgWc.', "updated_at" = '2011-12-31 08:06:29.275703' WHERE "users"."id" = 3