app/views/resumes/show.html.erb

SELECT `sections`.* FROM `sections` WHERE `sections`.`resume_id` = 21
---
<div id="resume_portal">
<% @resume.sections.sort_by {|obj| obj.order}.each do |section| %>

SELECT `items`.* FROM `items` WHERE `items`.`section_id` = 1
---
<div class="section_body sortable">
<% section.items.sort_by {|obj| obj.order}.each do |resumeItem| %>